Repository: 84000/data-translation-memory
Catalog: toh431-v1.tmx
Source language: bo
Languages: en

source: བུད་མེད་དང་བྲལ་ཅི་བྱས་ཀྱང་། །གཞན་དུ་འཆི་འགྱུར་དངོས་གྲུབ་མིན། །
en: Apart from causing his own death, Does he achieve anything by separating himself from women?

source: དཀའ་ཐུབ་ཀྱིས་ནི་འགྲུབ་མི་འགྱུར། །
en: Can never be accomplished by religious austerities.

source: འབྲས་མེད་གཏི་མུག་དྲ་བས་བཅིངས། །
en: It would be fruitless due to the net of delusion—

source: འདོད་ལྡན་འདོད་པ་སྤོང་བྱེད་པ། །བརྫུན་གྱིས་འཚོ་བ་སྐྱེ་འགྱུར་ཏེ། །
en: “A lover must not abandon lust, Lest he would be living a lie.

source: བརྫུན་གྱིས་གང་འཚོ་སྡིག་པ་སྟེ། །སྡིག་པས་དམྱལ་བར་འགྲོ་བར་འགྱུར། །
en: By living a lie, evil is incurred; And from evil, a rebirth in hell.

source: འཆི་བའི་དུས་ནི་ཐོབ་པ་ན། །བརྫུན་གྱིས་འཚོ་བར་ཐེ་ཚོམ་མེད། །
en: “He who lives a lie will meet his death, There is no doubt.

source: བདག་ཉིད་དཀའ་ཐུབ་གདུང་མི་བྱ། །
en: “So one should not torment oneself with austerities,

source: འདོད་ཡོན་ལྔ་པོ་དེ་སྤངས་ནས། །
en: Abandoning the five sense-objects.

source: སྒྲ་ཡང་དེ་བཞིན་མཉན་པར་བྱ། །
en: And listen to the sound.

source: དྲི་ནི་མན་མ་པར་བྱ་བ་སྟེ། །
en: “One should smell the odor

source: རོ་ཡི་མཆོག་ནི་བཟའ་བར་བྱ། །
en: And savor the supreme taste.

source: རེག་བྱ་རེག་པར་བྱ་བ་སྟེ། །
en: One should experience the sensation of touch,

source: འདོད་པ་ལྔ་པོ་བསྟེན་པར་བྱ། །
en: Pursuing the five types of sense-objects.

source: མྱུར་དུ་སངས་རྒྱས་མཆོག་འགྱུར་རོ། །
en: “One will quickly become awakened,

source: གཞན་ལ་སླུ་བ་མེད་གྱུར་ཅིང་། །གཏི་མུག་མཆོག་ཏུ་མེད་པར་བྱ། །
en: There is no greater deception, And no greater delusion,

source: མི་ཡི་ལང་ཚོ་ཐོབ་པ་ལ། །མི་མོའི་བདེ་བ་མི་སྤྱོད་ན། །
en: “Than a man spending his entire youth Without bringing enjoyment to women.

source: བཙུན་མོའི་སྐྱེ་གནས་ཡང་དག་བསྟེན། །ཁྲོ་བོ་གཏུམ་པོའི་གོ་འཕང་མཐོང་། །
en: Having seen that the seat of Caṇḍaroṣa Is nestled within the vulva of a woman,

source: གཉིད་ནི་ཇི་ལྟར་སྤང་བར་བྱ། །བཟའ་བ་དང་ནི་དགོད་པ་ཉིད། །
en: “How would they be able to sleep, eat, or laugh, If they abandoned it?

source: ལྷ་མོ་སྒྱུ་འཕྲུལ་སྲས་མཁས་པས། །
en: The son of Māyādevī—the wise teacher—

source: ན་ར་ཉྫ་ནའི་འགྲམ་གཤེགས་ནས། །
en: And went to the bank of Nairañjanā.

source: གང་ཕྱིར་བཙུན་མོའི་ན་ངསངས་རྒྱས། །གོ་པ་དང་བཅས་བདེ་ལྡན་གྲུབ། །
en: This was not so, since it was in the female quarters, that the Buddha, Experiencing pleasure in the company of Gopā, became accomplished.

source: རྡོ་རྗེ་པདྨ་མཉམ་སྦྱོར་བས། །གང་ཕྱིར་བདེ་བ་ལས་ཐོབ་བོ། །
en: “It is from the union of the vajra and the lotus That true pleasure is derived.

source: བདེ་བ་ལས་ཐོབ་སངས་རྒྱས་ནི། །
en: Awakening is attained through pleasure,

source: བདེ་བ་བུད་མེད་དང་བྲལ་མིན། །
en: And there is no pleasure in being separated from women.

source: གང་དུ་སྦྱོར་བྲལ་བྱ་བ་ནི། །
en: “However, he who enacts separation

source: རྒྱལ་བའི་སྒྱུ་མའི་གར་ཉིད་ཀྱིས། །དེ་དང་དེ་ཉིད་ཚུལ་གྱིས་སོ། །
en: Namely the victorious master of illusory displays— Enacts his part in that very form

source: མདོ་སྡེ་ཆོས་མངོན་ཐམས་ཅད་ནས། །བུད་མེད་རྣམས་ནི་སྨོད་མཛད་པ། །
en: By criticizing women In all the sūtra and Abhidharma literature,

source: སྣ་ཚོགས་སློབ་མའི་སྣོད་ཕྱིར་བཤད། །དེ་ཁོ་ན་ཉིད་སྦས་ནས་གསུངས། །
en: “He would teach different levels of training, His words concealing the truth.

source: ཕུང་པོ་ལྔ་དང་རྣམ་བྲལ་བའི། །མྱ་ངན་འདས་པ་བལྟ་བར་བྱ། །
en: He would also explain nirvāṇa As being the result of the cessation of the five aggregates.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མས་གསོལ་བ།
en: Then the blessed lady Prajñāpāramitā said,

source: བཅོམ་ལྡན་འདས་ལྷ་མོ་སྒྱུ་འཕྲུལ་གྱི་སྲས་གང་ལགས། །
en: “Who is that blessed one, the son of Māyādevī,

source: གོ་པཱ་ཡང་གང་ལགས།
en: and who is Gopā?”

source: ལྷ་མོ་སྒྱུ་འཕྲུས་སྲས་ཉིད་ཀྱང་། །ཁྲོ་བོ་གཏུམ་པོ་བདག་ཉིད་ཡིན། །
en: “I am the son of Māyādevī, Who has now become Caṇḍaroṣaṇa.

source: ཇི་སྙེད་པ་ཡི་བུད་མེད་ཀུན། །
en: “As many women as there are,

source: སྐྱེས་བུ་བདག་གི་གཟུགས་དེ་ཉིད། །དེ་བཞིན་ཀུན་ཏུ་ཡོངས་སུ་གྲགས། །
en: Men, on the other hand, are all said To be endowed with my form.

source: བཅོམ་ལྡན་འདས་ཅིའི་ཕྱིར་ཉན་ཐོས་ལ་སོགས་པ་རྣམས་བུད་མེད་སུན་འབྱིན་པར་བྱེད།
en: “Why, O lord, do the listeners and their like belittle women?”

source: གང་ཞིག་འདོད་པའི་ཁམས་གནས་པའི། །
en: “They all abide in the realm of desire—

source: ཉན་ཐོས་ལ་སོགས་གྲགས་ཀུན་གྱིས། །
en: Those who are called listeners and so forth.

source: ཐར་པའི་ལམ་ནི་མི་ཤེས་སོ། །
en: They do not know the path to liberation

source: གང་ན་ཉེ་བར་གནས་གྱུར་པའི། །གུར་གུམ་ལ་སོགས་རྙེད་སླ་ན། །
en: “In a situation where saffron and so on is close by And easy to obtain,

source: ཐོག་མེད་མི་ཤེས་སྦྱོར་བ་ཡིས། །དད་པ་དམན་པའི་སྐྱེ་བོ་འདི།
en: “Because of their ignorance that had no beginning, Those people are devoid of faith;

source: བདག་གིའང་འདི་ནི་རབ་ཏུ་སྦས། །
en: I, for my part, have concealed it very well.

source: སེམས་ཅན་རེ་རེར་བགྲངས་པ་ཡི། །བྱེ་བའི་ནང་ན་འགའ་ཞིག་ཀྱང་། །
en: If there is any being among the infinite numbers, Counted one by one,

source: དད་དང་བརྩོན་པའི་དཔུང་གཉེན་ཅན། །
en: For whom devotion and exertion are paramount,

source: བྱང་ཆུབ་མྱུར་དུ་རབ་བསྒྲུབ་ཕྱིར།
en: For the sake of its swift attainment of awakening.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས་མི་མོ་རབ་ཏུ་བསྔགས་པའི་རིམ་པར་ཕྱེ་བ་སྟེ་བཅུ་པའོ།། །།
en: Thus concludes the chapter on the praiseworthiness of women, the tenth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: བཅོམ་ལྡན་འདས་ཁྱོད་ཅི་སྟེ་ཆགས་པ་དང་བཅས་པའམ། ཆགས་པ་དང་བྲལ་བ་ལགས།
en: “Are you, O lord, with or without passion?”

source: བདག་ནི་ཀུན་ཏེ་ཀུན་ལའང་ཁྱབ། །
en: “I am everyone, and I pervade everything,

source: ཀུན་བྱེད་ཀུན་གྱི་འཇིག་པ་པོ། །
en: Creating everything and destroying everything.

source: ཀུན་གྱི་གཟུགས་འཛིན་སངས་རྒྱས་ཏེ། །
en: I possess all forms, I am the awakened one;

source: བྱེད་པོ་འཇོམས་པོ་ཁྱབ་བདག་བདེ། །
en: I am the creator, the destroyer, a powerful lord full of bliss.

source: གང་དང་གང་གི་གཟུགས་ཀྱིས་ནི། །སེམས་ཅན་འདུལ་བྱར་འདི་ཉིད་འཇུག །དེ་དང་དེ་ཉིད་ཚུལ་གྱིས་ནི། །
en: “Through whatever form Beings may be guided, In that very form,

source: འཇིག་རྟེན་དོན་རྒྱུར་བདག་གནས་སོ། །
en: I abide For the benefit of the world.

source: འགའ་ཞིག་སངས་རྒྱས་གྲུབ་ཐོབ་འགའ། །
en: “Sometimes I am the Buddha, sometimes a siddha,

source: ལ་ལར་ཆོས་དང་དགེ་འདུན་ནོ། །
en: Sometimes the Dharma, sometimes the Saṅgha,

source: ལ་ལར་ཡི་དགས་ལ་ལར་ཕྱུགས། །
en: Sometimes a hungry ghost, sometimes an animal,

source: ལ་ལར་དམྱལ་བའི་གཟུགས་ཅན་ནོ། །
en: Sometimes I assume the form of a hell being.

source: ལ་ལར་ལྷ་དང་ལྷ་མ་ཡིན།
en: “Sometimes I am a god, sometimes a demigod,

source: ལ་ལར་མི་ཡི་གཟུགས་ཅན་ནོ། །
en: Sometimes I assume a human form,

source: སྣ་ཚོགས་གཟུགས་ཅན་ཐེ་ཚོམ་མེད། །
en: I possess all forms, there is no doubt.

source: བདག་ནི་སྐྱེས་པ་བུད་མེད་དང་། །
en: “I am a woman and also a man,

source: མ་ནིང་གཟུགས་སུའང་ལ་ལར་རོ། །
en: Sometimes I have a genderless form.

source: ལ་ལར་ཆགས་ཅན་ལ་ལར་སྡང་། །
en: Sometimes I am affectionate, sometimes hateful,

source: ལ་ལར་རྨོངས་ཤིང་ལ་ལར་གཙང་། །
en: Sometimes deluded, sometimes pure,

source: ལ་ལར་མི གཙང་གཟུགས་སུ་ང་། །
en: “Sometimes I have an impure form.

source: སེམས་ཀྱི་གཟུགས་ཀྱིས་བདག་གནས་སོ། །
en: I exist essentially as mind;

source: བདག་ནི་སེམས་སུ་བལྟ་བར་བྱ། །
en: It is my mind that is perceived—

source: དངོས་པོ་དངོས་མེད་རབ་དབྱེ་ང་། །
en: “I can be categorized as a thing or a no-thing;

source: ང་ནི་བསྐྱེད་བྱ་སྐྱེད་བྱེད་པ། །
en: I am one that can be generated, and also one who generates.

source: བདག་ནི་བགེགས་དང་གྲུབ་པ་ང་། །
en: I am an obstacle and I am an accomplishment,

source: ཀུན་གྱི་གཟུགས་ཀྱིས་ཡང་དག་གནས། །
en: Abiding in every form.

source: ང་ནི་སྐྱེ་དང་འཆི་བའང་ང་། །
en: “I am birth and I am death,

source: ང་ནི་ནད་དང་རྒས་པའ་ངང་། །
en: I am disease and I am old age.

source: ང་ནི་བསོད་ནམས་སྡིག་པའང་ང་། །དེ་ཡི་ལས་ཀྱི་འབྲས་ཉིད་ང་། །
en: I am virtue and I am nonvirtue, And I am the karmic result of these two.

source: ཀུན་དུ་བདག་གི་གཟུགས་ཉིད་འདི།
en: And all these forms are of myself—

source: རོ་མཉམ་རྣམ་པར་ཤེས་པར་བྱ། །
en: They should be known as forms, in essence the same,

source: ཅི་སྟེ་ཁྱོད་ཀྱི་གཟུགས་ཉིད་འདི་ལྟ་བུ་ཡིན་ནམ།
en: “Are these forms only of you?”

source: ཇི་ལྟར་ཁྱོད་ཀྱི་གཟུགས་ཉིད་ཀྱང་། །རྣམ་པ་དེ་ལྟར་ཀུན་ནས་གསུངས།
en: “Such forms are of yourself, as well; All that has been explained.

source: འདིར་ནི་ཁྱོད་ཀྱིས་ཁྱབ་པ་པོ།
en: All this is permeated by you—

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས་སྣ་ཚོགས་པའི་རིམ་པར་ཕྱེ་བ་སྟེ་བཅུ་གཅིག་པའོ།། །།
en: Thus concludes the chapter of the universality of Caṇḍa­mahā­roṣaṇa, the eleventh in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: སྔགས་རྣམས་ཀྱི་ནི་སྒྲུབ་པའི་ཐབས། །ཞི་དང་རྒྱས་པ་དེ་ཉིད་གསུངས། །
en: “Please explain about applying mantras— The pacifying and the enriching;

source: དབང་དང་དགུག་པའི་རབ་སྦྱོར་དང་། །གསད་དང་བསྐྲད་པ་ལ་སོགས་དང་། །
en: The practices of enthralling and summoning; The killing, the driving away, and so forth.

source: དུག་སེལ་བ་དང་ནད་ཞི་དང་། །
en: “The removing of poison, the removing of disease,

source: མེ་དང་རལ་གྲི་སོགས་རེངས་དང་། །
en: The stopping of a fire or a sword.

source: གཡུལ་དུ་རྣམ་པར་རྒྱལ་བ་དང་། །
en: Also the victory in battle

source: མཁས་པ་ཡི་ནི་མཆོག་ཉིད་དང་། །
en: And the most eminent scholarship.

source: གནོད་སྦྱིན་མོ་སྒྲུབ་བྲན་དང་ནི། །ཕོ་ཉ་འབྱུང་སོགས་སྒྲུབ་ཐབས་དང་།
en: “The sādhana of yakṣiṇīs that inducts them into service, The sādhanas of dūtas and bhūtas—

source: ཁྱོད་ལ་མཆོག་ཅི་ཞིག་སྦྱིན་པར་བྱ།
en: ‘What boon shall I grant you?’

source: ཞེས་པ་དང་སྒྲུབ་པ་པོས་སྨྲ་བར་བྱ་སྟེ།
en: The sādhaka should reply:

source: སངས་རྒྱས་ཉིད་སྩོལ་ཅིག་ཅེས་སོ། །
en: ‘Grant me the state of awakening.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེའི་ལུས་ལ་རབ་ཏུ་ཞུགས་སོ། །
en: Then the lord will enter his body.

source: རབ་ཏུ་ཞུགས་པ་ཙམ་གྱིས།
en: As soon as he enters,

source: ལོ་བརྒྱད་གཉིས་ཀྱི་རྣམ་པ་ཅན།
en: the bodily form of a sixteen-year-old and

source: མངོན་པར་ཤེས་པ་དྲུག་པ།
en: the six superknowledges.

source: ས་བཅུ་གསུམ་གྱི་དབང་ཕྱུག །
en: the master of the thirteenth bodhisattva level,

source: ལྷའི་གཞལ་ཡས་ཁང་ན་སྤྱོད་པ་ཅན་གྱི་ལྷའི་བུ་མོའི་ཚོགས་བརྒྱ་སྟོང་གིས་བརྒྱན་པ།
en: living in a celestial mansion, with a retinue of hundreds of thousands of apsarases gracing him.

source: འདོད་པའི་གཟུགས་ཅན་ཐམས་ཅད་མཁྱེན་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་ཏོ།
en: He obtains an alluring form, becomes omniscient and just like the lord Caṇḍa­mahā­roṣaṇa.

source: ཇི་ལྟར་མངོན་པར་འདོད་པ་བཞིན་ཞུ་བར་བྱ་སྟེ།
en: one should request, according to one’s wish,

source: རྐང་མགྱོགས་དང་། རྐང་པའི་བྱུག་པ་དང་།
en: shoes for sky-travel, foot ointment for fast walking,

source: རྒྱལ་སྲིད་དང་།
en: a kingdom,

source: འདོད་པ་ལ་ལོངས་སྤྱོད་པའི་དབང་ཕྱུག་དང་།
en: superhuman potency for sensual gratification,

source: རིག་པ་དང་། ནོར་ཅན་དང་།
en: knowledge of spells, wealth,

source: གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་མོ་དང་།
en: yakṣas, yakṣiṇīs,

source: དེ་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་སྟེར་བར་བྱེད་དོ། །
en: the lord will give all of this.

source: ཡང་ན་དཔའ་བོ་གཅིག་པའི་རས་རིས་བྲིས་ལ་སྔོན་མ་བཞིན་དུ་བསྒྲུབ་པར་བྱའོ། །
en: “Or else one could commission someone to paint Sole Hero on a canvas and practice as before.

source: དེ་ལ་དཔའ་བོ་གཅིག་པའི་རི་མོ་ནི་
en: Here in the painting of Sole Hero,

source: མི་གཡོ་བ་ནག་པོ་ལ་ཞེ་སྡང་རྡོ་རྗེ་མས་འཁྱུད་པའོ། །
en: Black Acala is embraced by Hatred Vajrī;

source: མི་གཡོ་བ་དཀར་པོ་ལ་གཏི་མུག་རྡོ་རྗེ་མས་སོ། །
en: White Acala by Delusion Vajrī;

source: མི་གཡོ་བ་སེར་པོ་ལ་ཕྲ་མ་རྡོ་རྗེ་མས་སོ། །
en: Yellow Acala by Calumny Vajrī;

source: མི་གཡོ་བ་དམར་པོ་ལ་འདོད་ཆགས་རྡོ་རྗེ་མས་སོ། །
en: Red Acala by Passion Vajrī;

source: མི་གཡོ་བ་ལྗང་གུ་ལ་ཕྲག་དོག་རྡོ་རྗེ་མས་འཁྱུད་པ་བྲི་བར་བྱའོ། །
en: and Green Acala should be painted embraced by Envy Vajrī.

source: ཡང་ན་ཤེས་རབ་དང་བྲལ་བའི་བཅོམ་ལྡན་འདས་གཅིག་པུ་བྲི་བར་བྱའོ། །
en: Or else the lord should be painted alone, without a consort.

source: ཡང་ན་རི་མོ་ལ་བཅོམ་ལྡན་འདས་མ་ལྔ་པོ་རྣམས་ཀྱི་དབུས་ན་གཅིག་ཏུ་བྱས་ལ།
en: “As another option, the blessed lady should be painted on the canvas alone in the center, between the five Acalas.

source: དེར་བདག་ཉིད་དེའི་བདག་པོའི་གཟུགས་སུ་བསམས་ནས་
en: Then, imagining oneself as having the form of her husband,

source: ཡང་ན་རང་གི་བུད་མེད་ལྷ་མོའི་གཟུགས་སུ་བསམས་ནས་བསྒྲུབ་པར་བྱའོ། །
en: Or, imagining one’s own wife as having the form of the goddess, one should do the practice.

source: གྲུབ་པར་གྱུར་ན། སངས་རྒྱས་ཉིད་ཀྱང་སྟེར་བར་བྱེད་ན་དངོས་གྲུབ་གཞན་སྨོས་ཅི་དགོས།
en: Being accomplished, she can grant even the state of awakening, let alone other accomplishments.

source: ཡང་ན་ཞབས་གཡོན་བརྐྱང་བ་རལ་གྲི་དང་ཞགས་པ་བསྣམས་པས་བསྒྲུབ་པར་བྱའོ།
en: “Or one should do the practice of the lord standing with his left leg outstretched and the right slightly bent, and holding a sword and a noose.

source: སེམས་དཔའི་སྐྱིལ་ཀྲུང་ཅན།
en: sitting in the sattvaparyaṅka posture and

source: རལ་གྲི་དང་ཞགས་པ་ཕྱག་ན་བསྣམས་པ།
en: holding a sword and a noose in his hands,

source: འདི་ཉིད་བཅོམ་ལྡན་འདས་ཀྱི་རི་མོའི་དངོས་གྲུབ་བོ།
en: would be the accomplishment involving the lord painted on canvas.

source: ལྕགས་ཀྱི་རང་བཞིན་དང་། ཤིང་གི་སྙིང་པོའི་རང་བཞིན་ལས་སམ།
en: one made of either quality iron or hard wood

source: ལག་པ་གཉིས་ཀྱིས་ཡོངས་སུ་བཟུང་ནས།
en: One should grasp it with both hands and

source: ཐུན་མཚམས་གསུམ་དང་ཟླ་བ་གཅིག་ཏུ་བཟླས་པར་བྱའོ། །
en: recite the mantra at the three junctions of the day for one month.

source: ཟླ་བའི་མཐར་མཆོད་པ་ཆེན་པོ་བྱས་ནས་མཚན་མོ་རིལ་པོ་བཟླས་པ་བྱའོ། །
en: At the end of the month, one should offer extensive worship and recite for the entire night.

source: ཐོ་རངས་རལ་གྲི་འབར་བར་འགྱུར་ཏེ།
en: In the morning, the sword will burst into flames.

source: རལ་གྲིའི་རིག་པ་འཛིན་པར་འགྱུར་ཏེ།
en: One then becomes the holder of the magical power of the sword,

source: ལོ་བརྒྱད་གཉིས་ཀྱི་རྣམ་པ་ཅན་སྐྲ་འཁྱིལ་པ་འདི་ནི། །
en: with the bodily form of a sixteen-year-old with curled hair.

source: དེ་བཞིན་དུ་ཟངས་ལ་སོགས་པའི་རང་བཞིན་གྱི་ཞགས་པ་བསྒྲུབ་པར་བྱའོ། །
en: And so also with a noose made of copper and so on.

source: གོས་དང་། གདུགས་དང་།
en: clothes, a parasol,

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མའི་པོ་ཏི་དང་།
en: a Prajñāpāramitā text,

source: རྒྱུད་ཀྱི་པོ་ཏི་ལ་སོགས་པ་
en: a tantra text, and so forth.

source: དེ་བཞིན་དུ་རྔ་པ་ཊ་ཧ་དང་། རྔ་བོ་ཆེ་དང་། པི་ཝང་ལ་སོགས་པ་བསྒྲུབ་པར་བྱའོ། །
en: So too one can practice with a paṭaha drum, a mardala drum, a lute, and so forth.

source: དེ་བཞིན་དུ་གསེར་གྱི་རང་བཞིན་ལས། གནོད་སྦྱིན་ཛམྦྷ་ལ་དང་། ནོར་བུ་བཟང་པོ་དང་། གང་བ་བཟང་པོ་དང་། པི་ཅི་ཀུཎྜ་ལི་ལ་སོགས་པ་བསྒྲུབ་པར་བྱའོ། །
en: In the same way, one should practice with a golden yakṣa, starting with Jambhala, Maṇibhadra, Pūrṇabhadra, and Cibikuṇḍalin.

source: དེ་བཞིན་དུ་སྨྱུག་མའི་རང་བཞིན་ལས་དྲི་བཟང་བསྒྲུབ་པར་བྱའོ། །
en: “In the same way, one should practice with a gandharva made of bamboo;

source: གྲོག་མཁར་གྱི་སའི་རང་བཞིན་ལས་ནམ་མཁའ་ལྡིང་ངོ་། །
en: a garuḍa made of anthill clay;

source: ཐང་ཤིང་གི་རང་བཞིན་ལས་ལྷ་རྣམས་ཏེ། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དབང་པོ་དང་། འདོད་ལྷ་ལ་སོགས་པ་རྣམས་སོ། །
en: the gods Brahmā, Viṣṇu, Maheśvara, Indra, Kāmadeva, and so forth, made of deodar tree;

source: དུར་ཁྲོད་ཀྱི་སོལ་བས་སྲིན་པོ་བྲི་བར་བྱའོ། །
en: a rākṣasa drawn with charcoal from the charnel ground;

source: ག་ཌའི་ཉ་ཚིག་པས་ཡི་དགས་བྲི་བར་བྱའོ། །
en: a preta drawn with potash of a burnt goldfish;

source: སྤྲ་ཚིལ་གྱིས་མིའོ། །
en: a human made of beeswax;

source: གླང་པོ་ཆེའི་རང་བཞིན་ལས་ཚོགས་བདག་གོ། །
en: Gaṇapati made of ivory;

source: ཤཱ་ཁོ་ཊའི་ཤིང་གི་རང་བཞིན་ལས་པཱི་ལུ་བ་ལཱ་ཤ་ལ་སོགས་པའི་ཤ་ཟའོ། །
en: the piśāca Pīlupāla made of the wood of toothbrush tree;

source: པྲ་པཱ་ལའི་ཉ་ལས་གོོ་རཱི་ཙོོ་རཱི་ལ་སོགས་པ་བྲི་བར་བྱའོ། །
en: the ḍākinīs Gaurī, Caurī, and so forth, drawn with potash of burnt pravāla fish

source: མིའི་རུས་པའི་རང་བཞིན་ལས་རཱ་མ་དེ་བ་དང་། འདོད་པའི་ལྷ་ལ་སོགས་པའི་རོ་ལངས་སོ། །
en: the vetālas Rāmadeva, Kāmadeva, and so forth, made of human bone;

source: ནཱ་ག་གེ་སར་གྱི་ཤིང་གི་རང་བཞིན་ལས་ནོར་རྒྱས་ལ་སོགས་པའི་ཀླུ་དང་། ཀླུ་མོ་རྣམས་སོ། །
en: the nāgas Vāsuki and so forth, also the nāginīs, made of nāgakesara wood;

source: འཕྲོག་མ་དང་། ལྷ་མོ་སུནྡ་རི་དང་།
en: Hārītī, Surasundarī,

source: གར་མ་དང་། དགའ་མ་དང་། ཡིད་འོང་མ་དང་། ཤྱ་མ་ནུ་ཌི་དང་།
en: Naṭṭā, Ratipriyā, Śyāmā, Naṭī,

source: པདྨ་ཅན་དང་། རྗེས་སུ་ཆགས་མ་དང་།
en: Padminī, Anurāginī,

source: ཟླ་འོད་མ་དང་། ཚངས་པའི་བུ་མོ་དང་།
en: Candrakāntā, Brahmaduhitā,

source: འདོད་པའི་དབང་ཕྱུག་མ་དང་། མིའི་བུ་མོ་དང་།
en: Vadhū, Kāmeśvarī,

source: རེ་བ་ཏཱི་དང་།
en: Revatī,

source: ན་ར་དྷི་ར་ལ་སོགས་པ
en: Naravīrā, and so forth,

source: མྱ་ངན་མེད་པའི་ཤིང་གི་རང་བཞིན་ལས་
en: made of the wood of the aśoka tree.

source: ནྱ་གྲོདྷའི་ཤིང་གི་རང་བཞིན་ལས་དཔལ་ལྷ་མོ་དང་། རྒྱལ་པོའོ། །
en: with the chief queen and the king made of banyan wood,

source: ཐང་ཤིང་གི་རང་བཞིན་ལས།
en: made of deodar wood.

source: ཏིལ་མཆོག་མ་དང་། ཟླ་བའི་ལྷ་མོ་དང་།
en: Tilottamā, Śaśidevī,

source: གསེར་ཕྲེང་མ་དང་། ཀུཎྜ་ལ་ཧ་རཱི་ཎི་དང་།
en: Kañcanamālā, Kuṇḍalahāriṇī,

source: རམ་བྷཱ་དང་། ཨུར་བཱ་ཤཱི་དང་།
en: Ārambhā, Urvaśī,

source: དཔལ་གྱིས་བརྒྱན་མདང་། དགའ་མ་དང་། དབང་མོ་ལ་སོགས་པ་
en: Śrībhūṣaṇī, Ratī, Śacī, and so forth,

source: གཟའ་དགུའོ། །
en: the nine planets

source: ཉི་མ་དང་། ཟླ་བ་དང་།
en: —the sun, the moon,

source: བཀྲ་ཤིས་དང་། ལྷག་པ་དང་།
en: Mars, Mercury,

source: ལྷའི་བླ་མ་དང་། ཕ་བསངས་དང་།
en: Jupiter, Venus,

source: སྤེན་པ་དང་། སྒྲ་གཅན་དང་། དུ་བ་དང་།
en: Saturn, Rāhu, and Ketu.

source: དེ་བཞིན་དུ་འཇིག་རྟེན་དབང་ཕྱུག་དང་། ཕྱག་ན་རྡོ་རྗེ་དང་། འཇམ་དཔལ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སོ།
en: Similarly the practice of the bodhisattvas, starting with Avalokiteśvara, Vajrapāṇi, and Mañjuśrī.

source: དེ་བཞིན་དུ་རྣམ་པར་གཟིགས་དང་། གཙུག་ཏོར་ཅན་ཏེ་སངས་རྒྱས་རྣམས་བསྒྲུབ་པར་བྱའོ། །
en: Likewise the practice of the buddhas, starting with Vipaśyin and Śikhin.

source: དེ་བཞིན་དུ་གཞན་གྱིས་མི་ཐུབ་པ་ལ་སོགས་པའི་འབྱུང་པོ་རྣམས་སོ། །
en: So too the practice of the bhūtas, starting with Aparājita.

source: དེ་བཞིན་དུ་གཤིན་རྗེ་ལ་སོགས་པ་འཕགས་པའི་ཕོ་ཉ་རྣམས་སོ། །
en: Also the messengers, starting with Yamāri.

source: དེ་བཞིན་དུ་ཀཾ་ཀ་ལ་སོགས་པའི་བྲན་རྣམས་སོ། །
en: Similarly the servants, starting with Vajrakaṃkāla.

source: དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕོ་མོ་རྣམས་བསྒྲུབ་པར་བྱའོ། །
en: In the same way, one should do the practice of all beings—women and men.

source: ཐམས་ཅད་བཀའ་སྒྲུབ་པ་བྱེད་པ་པོར་འགྱུར་རོ། །
en: All of them will carry out one’s orders.

source: གལ་ཏེ་ལན་ཅིག་གིས་གྲུབ་པར་མ་གྱུར་ན།
en: “Now if one does not succeed the first time,

source: དེ་ལ་ལན་གཉིས་པ་ཡང་བྱའོ། །
en: one should do it for the second time.

source: དེའི་ཚེ་ཡང་མ་གྲུབ་ན་ལན་གསུམ་པ་ཡང་བརྩམ་པར་བྱའོ། །
en: If this is likewise unsuccessful, one should do it for the third time.

source: དེ་ལྟར་ན་ཡང་མི་དགེ་བ་ཆེན་པོའི་དབང་གིས་གལ་ཏེ་མ་གྲུབ་ན།
en: If one does not succeed even then due to previously committed evil acts,

source: དེའི་ཚེ་སྔོན་བཞིན་དུ་པུས་མོ་གཡོན་པའི་ཁར་རྐད་པ་གཡས་པས་ཀྱང་མནན་ནས།
en: then, standing astride with one’s left knee and right foot on the ground,

source: ཇི་སྲིད་མ་གྲུབ་པ་དེ་སྲིད་བཟླས་པ་བྱའོ། །
en: one should recite the mantra until one succeeds.

source: དེ་ནས་ཚངས་པ་འཇོམས་པ་པོས་ཀྱང་འགྲུབ་བོ། །
en: After this, even a slayer of a brahmin would succeed.

source: དེ་ལ་འདིར་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་སྒྲུབ་ཐབས་ཀྱི་སྔགས་ཀྱི་ནང་དུ་བྱས་ནས།
en: “For the above practices of Caṇḍa­mahā­roṣaṇa, the following mantras apply:

source: ཨོྃ་ཙཎྜ་མ་ཧཱ་རོ་ཥ་ཎ་ཨཱ་གཙྪ་ཨཱ་གཙྪ་ཧཱུྃ་ཕཊ།
en: Oṁ , Caṇḍa­mahā­roṣaṇa, come, come! Hūṁ phaṭ

source: རལ་གྲི་ལ་སོགས་པ་བསྒྲུབ་ན་
en: “If practicing with the sword and so on,

source: ཆེ་གེ་མོ་སྒྲུབས་ཤིག་ཅེས་སྦྱར་བར་བྱའོ། །
en: one should add: ‘ Make such and such respond to my practice!

source: གང་གི་ཚེ་མནན་ནས། ཆེ་གེ་མོ་ལ་ཧ་ན་ཧ་ན་ཞེས་སྦྱར་བར་བྱའོ། །
en: “When placing the feet astride, one should add: ‘ Kill such and such, kill!

source: དེ་ལྟར་ལན་ཅིག་བརྗོད་པས་
en: “In this way, with a single recitation,

source: མཚམས་མེད་པ་ལྔ་པོ་བྱེད་པས་ཀྱང་ཐམས་ཅད་སྲེག་པར་བྱེད་དོ། །
en: one burns even the five inexpiable actions.

source: སརྦ་པཱ་པཾ་མི་ནཱ་ཤ་ཡ་ཏི་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add: ‘Destroy all my evil!’

source: དེ་བཞིན་དུ་འཇིགས་པ་ཐམས་ཅད་ལ་བརྗོད་པ་ཙམ་གྱིས་སྲུང་བར་བྱེད་དོ། །
en: “In this way, by a mere utterance, one effects the protection from all fears.

source: རཀྵ་རཀྵ་ཏི་ཞེས་བརྗོད་པར་བྱའོ། །
en: One should add: ‘ Protect me, protect!

source: དེ་ནས་རབ་ཏུ་འབར་བཞིན་པའི་ལྕགས་སུ་བསམས་ནས།
en: “Then, visualizing the iron as if ablaze,

source: ཡུངས་ཀར་དང་སྲན་མ་མུད་གང་དང་། མཱ་ཥ་ལ་བརྒྱ་རྩ་བརྒྱད་རང་གི་སྔགས་ཀྱིས་མངོན་པར་བསྔགས་ནས་
en: one should incant mustard seeds, mung beans, or māṣa pulses with one’s personal mantra 108 times.

source: ཐམས་ཅད་འབྲོས་པར་བྱེད་དོ།
en: They will all flee.

source: བྲབ་པའི་དུས་སུཌཱ་ཀི་ནྱཱ་དི་ཀ་མ་པ་སཱ་ར་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: At the time of striking, one should add the mantra: ‘ Make the ḍākinīs and the rest go away!

source: པདྨ་འདབ་མ་བརྒྱད་པའི་ནང་དུ་སྔགས་བྲིས་ནས་ཁ་སྦྱར་ཏེ།
en: “Then one should write the mantra with chalk inside an eight-petaled lotus and cover it with a lid

source: ཡང་ན་ཐོད་ལོ་ཀོར་གྱིས་ཁམ་ཕོར་སོ་མ་བཏང་བ་གཉིས་ལ།
en: in a pair of vessels of unbaked clay.

source: ཉ་རྒྱས་དཀྲིས་ནས་སྒོལ་བཅང་བར་བྱའོ། །
en: One should wrap this in a fisherman’s net and have it suspended in a doorway

source: བྱིས་པ་རྣམས་ཀྱི་སྲུང་བར་བྱེད་དོ། །
en: —this effects protection of children.

source: རཀྵ་རཀྵ་པཱ་ལ་ཀཾ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Protect the child, protect!

source: སྤྲ་ཚིལ་ལས་བསྒྲུབ་བྱའི་གཟུགས་བརྙན་སོར་བཞི་པ་བྱས་ཏེ།
en: “One should make a beeswax effigy of the target, four finger-widths high.

source: གྲོ་ག་ལ་སྔགས་མངོན་པར་བྲིས་ནས་
en: One should inscribe the mantra on birch bark,

source: དེའི་སྙིང་གར་སྐེ་ཚེ་ལ་སོགས་པ་རབ་ཏུ་གཞུག་པར་བྱའོ། །
en: place it in the effigy’s heart, and strike the spot with black mustard seeds or similar substances.

source: དེ་ནས་ཚེར་མས་ཁ་ལ་ཕུར་བུས་གདབ་པར་བྱའོ། །
en: One should then nail the mouth with a thorn

source: ཕྱིར་རྒོལ་བའི་ཁ་ལ་ཕུར་བུས་བཏབ་པར་འགྱུར་རོ། །
en: —the mouth of the opponent will be sealed.

source: ལྷ་སྦྱིན་གྱི་མུ་ཁཾ་ཀཱི་ལ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should then add the mantra: ‘ Nail the mouth of such and such!

source: ལམ་གྱི་བཞི་མདོར་བརྐོས་ནས་དེ་བཞིན་དུ་རྐང་པ་ལ་ཕུར་བུས་གདབ་པར་བྱའོ། །
en: “One should bury the effigy at a crossroads. Similarly one should nail the feet,

source: འགྲོ་བ་དང་འོང་བ་རེངས་པར་བྱེད་དོ། །
en: which will stop the target from moving about.

source: ལྷ་སྦྱིན་གྱི་རྐང་པ་ལ་ཀཱི་ལ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Nail the feet of such and such!

source: ལྷ་སྦྱིན་གྱི་ཧྲྀ་ད་ཡཾ་ཀཱི་ལ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should then add the mantra: ‘ Nail the heart of such and such!

source: འགའ་ཞིག་གི་ཡན་ལག་ལ་ཕུར་བུས་བཏབ་ན་
en: “Whichever limbs one nails

source: མིའི་རུས་པའི་ཕུར་བུའམ་ལྕགས་ཀྱི་ཕུར་བུའམ།
en: with a nail of human bone, or an iron one,

source: དེ་ཟུག་རྔུ་ཆེན་པོར་འགྱུར་རོ། །
en: will become weak and in great pain.

source: ལྷ་སྦྱིན་གྱི་ཡན་ལག་ཆེ་གེ་མོ་ལ་ཀཱི་ལ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Nail such and such body part of such and such a person!

source: གང་གིས་ཁང་པའི་སྒོ་རུ་བརྐོས་ནས་སྦས་ན་དེ་སྐྲོད་པར་བྱེད་དོ། །
en: “By burying the effigy at someone’s entrance door, one will make the resident homeless.

source: ལྷ་སྦྱིན་བསྐྲད་པར་གྱིས་ཤིག་ཅེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Make such and such homeless!

source: དུར་ཁྲོད་ཀྱི་ཐལ་བ་ལ་མངོན་པར་བསྔགས་ནས་སྒོ་གླེགས་ལ་གཏོར་ན་སྐྲོད་པར་བྱེད་དོ། །
en: By throwing incanted ashes from a charnel ground at someone’s doorway, one will expel him.

source: ལྷ་སྦྱིན་ཨུཙྪ་ཊ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Expel such and such!

source: གཟུགས་བརྙན་ལ་ཚེར་མས་བཏབ་ནས་བཟླས་པར་བྱའོ། །
en: “Having incapacitated the effigy with thorns, one should recite the mantra.

source: ལྷ་སྦྱིན་མཱ་ར་ཡ། ཞེས་སྦྱར་ན་འཆི་བར་བྱེད་དོ།
en: One should add the mantra: ‘ Kill such and such!

source: རལ་གྲི་ལ་སོགས་པ་ལ་རང་གི་སྔགས་ཀྱིས་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་ནས་
en: “Having used one’s personal mantra to incant a sword or the like 108 times,

source: གཡུལ་དུ་འཇུག་པར་བྱས་ན་རྒྱལ་བར་འགྱུར་རོ། །
en: one should engage in battle. One will meet with victory.
